MarlinFirmware/Marlin/zTylers work/Sunhokey i3 firmware (28 Apr)/Marlin-Marlin_v1/ArduinoAddons/Arduino_1.x.x/hardware/rambo/boards.txt
# See: http://code.google.com/p/arduino/wiki/Platforms

##############################################################

mega2560.name=RAMBo

mega2560.upload.protocol=wiring
mega2560.upload.maximum_size=258048
mega2560.upload.speed=115200

mega2560.bootloader.low_fuses=0xFF
mega2560.bootloader.high_fuses=0xD8
mega2560.bootloader.extended_fuses=0xFD
mega2560.bootloader.path=stk500v2
mega2560.bootloader.file=stk500boot_v2_mega2560.hex
mega2560.bootloader.unlock_bits=0x3F
mega2560.bootloader.lock_bits=0x0F

mega2560.build.mcu=atmega2560
mega2560.build.f_cpu=16000000L
mega2560.build.core=arduino
mega2560.build.variant=standard
